УТ_для_edt/src/DataProcessors/CRM_Приложения/CRM_Приложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>CRM_Приложения</name>
</mdclass:DataProcessor>

УТ_для_edt/src/InformationRegisters/CRM_НастройкиРабочегоСтола/CRM_НастройкиРабочегоСтола.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_НастройкиРабочегоСтола</name>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Синоним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Параметры</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ИмяФормы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Пользователи</types>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Скрытая</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/CRM_CallTrakingСценарии/CRM_CallTrakingСценарии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_CallTrakingСценарии</name>
  <enumValues>
    <name>Comagic</name>
  </enumValues>
  <enumValues>
    <name>ПочтовоеСообщение</name>
  </enumValues>
  <enumValues>
    <name>ВнешняяОбработка</name>
  </enumValues>
  <enumValues>
    <name>Calltouch</name>
  </enumValues>
  <enumValues>
    <name>Callibri</name>
  </enumValues>
  <enumValues>
    <name>Roistat</name>
  </enumValues>
  <enumValues>
    <name>WebService</name>
  </enumValues>
  <enumValues>
    <name>ВнешнийAPI</name>
  </enumValues>
  <enumValues>
    <name>РучнойВвод</name>
  </enumValues>
  <enumValues>
    <name>JivoSite</name>
  </enumValues>
  <enumValues>
    <name>UIS</name>
  </enumValues>
  <enumValues>
    <name>Mango</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/CRM_ИсточникиРекламныхКампаний/CRM_ИсточникиРекламныхКампаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ИсточникиРекламныхКампаний</name>
  <attributes>
    <name>СценарийАналитики</name>
    <type>
      <types>EnumRef.CRM_СценарииПолученияАналитики</types>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКОбработке</name>
    <type>
      <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
    </type>
  </attributes>
  <attributes>
    <name>Включено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательВизиты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательГлубинаПросмотра</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательИсточникиТрафика</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательПосетители</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательОтказы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательГеография</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательВремяНаСайте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательУстройства</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательРекламнаяКампания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПисьма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемаПисьма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресРасписания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>OAuthТокен</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Client_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Client_secret</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДозагрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДозагрузкаВыполнена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаДействия</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеОбработки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяСтандартнаяОбработка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникиПолученияЛидов</name>
    <comment>АПК:265 не проверять на орфографию имя</comment>
    <type>
      <types>CatalogRef.CRM_ИсточникиПолученияЛидов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательЯндексДирект</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>YD_Login</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>YD_Token</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>YD_ID_Приложения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>YD_КодПодтверждения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>YD_device_code</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>YD_Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>YD_client_secret</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RefreshТокен</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательURL</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательMedium</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательClientID</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательSource</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательЦелевыеДействия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РекламныеКампании</name>
    <attributes>
      <name>Использовать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Мероприятие</name>
      <type>
        <types>CatalogRef.МаркетинговыеМероприятия</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/CRM_УчетныеЗаписиМессенджеров/CRM_УчетныеЗаписиМессенджеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_УчетныеЗаписиМессенджеров</name>
  <predefined>
    <items>
      <name>B2BПортал</name>
      <description>B2B портал</description>
    </items>
    <items>
      <name>СистемаВзаимодействия</name>
      <description>Система взаимодействия</description>
    </items>
  </predefined>
  <attributes>
    <name>CRM_ИсточникЛидов</name>
    <comment>АПК:265 не проверять на орфографию имя</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РольОтветственного</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_УказыватьПричинуОтклонения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Включена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПросмотрСообщенийВсемПользователям</name>
    <comment>Разрешить просмотр сообщений всем пользователям, независимо от настройки доступа</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипМессенджера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификаторЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеПараметровДоступа</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьIDГруппы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДатаНачальнойЗагрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТокен</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТокенГруппы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОбрабатыватьОбращения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьWebhook</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодWebhook</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПартнерГруппа</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПартнерСтатусРаботы</name>
    <type>
      <types>CatalogRef.CRM_СтатусыРаботыСКлиентом</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СоздаватьПартнера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокОбработкиДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокОбработкиМинут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокОбработкиЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПароль</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПользователь</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиСервер</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияИспользованияПриняты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ВариантАвтосозданияКлиентов</name>
    <comment>АПК:1032 АПК:265 не проверять на орфографию синоним и имя</comment>
    <type>
      <types>EnumRef.CRM_ВариантыАвтосозданияКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>смартГруппаПользователя</name>
    <comment>//++ #Б-3538 смарт: Фролов 10.06.2025 //Иерархия учетных записей мессенджеров и социальных сетей </comment>
    <type>
      <types>CatalogRef.ГруппыПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>смартПодразделениеПользователя</name>
    <comment>//++ #Б-3538 смарт: Фролов 10.06.2025 //Иерархия учетных записей мессенджеров и социальных сетей </comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <tabularSections>
    <name>CRM_ПравилаОбработки</name>
    <attributes>
      <name>УсловиеОбработки</name>
      <type>
        <types>CatalogRef.CRM_УсловияОбработкиОбращений</types>
      </type>
    </attributes>
    <attributes>
      <name>ПравилоОбработки</name>
      <type>
        <types>CatalogRef.CRM_ПравилаОбработкиОбращений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_Сценарии</name>
    <attributes>
      <name>Сценарий</name>
      <type>
        <types>CatalogRef.CRM_СостоянияИнтересов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/DataProcessors/CRM_Приложения/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// +Рабочий стол
	CRM_СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	// -Рабочий стол

КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияСтатистикаСайтаНажатие(Элемент)
	ПроверитьПодключениеОтраслевыхСервисовИОткрыть("СтатистикаСайта");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияВиджетНаСайтНажатие(Элемент)
	ПроверитьПодключениеОтраслевыхСервисовИОткрыть("ВиджетНаСайт");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСервисНаСайтНажатие(Элемент)
	ПроверитьПодключениеОтраслевыхСервисовИОткрыть("СервисНаСайт");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияCallТрекингНаСайтНажатие(Элемент)
	ПроверитьПодключениеОтраслевыхСервисовИОткрыть("CallТрекингНаСайт");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияИТСОтраслевойНажатие(Элемент)
	ПроверитьПодключениеОтраслевыхСервисовИОткрыть("ПроверитьИТСОтраслевой");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияТелефонияНажатие(Элемент)
	
	ОткрытьТелефонию();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗаголовокJivositeНажатие(Элемент)
	
	СтандартнаяОбработка = Истина;
	CRM_УправлениеПриложениямиКлиент.ВыполнитьДействиеПриКликеНаПриложение("ЛИТ_ИнтеграцияJivosite", СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		ПерейтиПоНавигационнойСсылке("https://myitlab.ru/portfolio-item/integratsiya-1s-i-jivochat-edinyj-chat-so-vsemi-klientami/");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗаголовокЛИТ_СкорингНажатие(Элемент)
	
	СтандартнаяОбработка = Истина;
	CRM_УправлениеПриложениямиКлиент.ВыполнитьДействиеПриКликеНаПриложение("ЛИТ_Скоринг", СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		ПерейтиПоНавигационнойСсылке("https://myitlab.ru/portfolio-item/scoring/");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗаголовокЛИТ_БиткопНажатие(Элемент)
	
	СтандартнаяОбработка = Истина;
	CRM_УправлениеПриложениямиКлиент.ВыполнитьДействиеПриКликеНаПриложение("ЛИТ_Биткоп", СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		ПерейтиПоНавигационнойСсылке("https://myitlab.ru/portfolio-item/integratsiya-bitcop-i-1s-crm/");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияМобильноеПриложениеНажатие(Элемент)
	ФормаНастроек = ОткрытьФорму("Обработка.CRM_ПанельАдминистрированияCRM.Форма.РазделСторонниеСервисы");
	ФормаНастроек.Элементы.ГруппаМобильныйСРМ.Показать();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияFacebookНажатие(Элемент)
	ПроверитьПодключениеОтраслевыхСервисовИОткрыть("МессенджерFacebook");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКартинкаInstagramНажатие(Элемент)
	ПроверитьПодключениеОтраслевыхСервисовИОткрыть("МессенджерInstagram");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКартинкаTelegramНажатие(Элемент)
	ПроверитьПодключениеОтраслевыхСервисовИОткрыть("МессенджерTelegram");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКартинкаWhatsAppНажатие(Элемент)
	ПроверитьПодключениеОтраслевыхСервисовИОткрыть("МессенджерWhatsApp");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКартинкаВКонтактеНажатие(Элемент)
	ПроверитьПодключениеОтраслевыхСервисовИОткрыть("МессенджерВКонтакте");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКартинкаViberНажатие(Элемент)
	ПроверитьПодключениеОтраслевыхСервисовИОткрыть("МессенджерViber");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПомощникиКартинкаНажатие(Элемент)
	ПроверитьПодключениеОтраслевыхСервисовИОткрыть("МоделиМашинногоОбучения");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияАКАМТоргиКартинкаНажатие(Элемент)
	СтандартнаяОбработка = Истина;
	CRM_УправлениеПриложениямиКлиент.ВыполнитьДействиеПриКликеНаПриложение("АКАМ_МодульТоргов", СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		ОткрытьФорму("ОбщаяФорма.АКАМ_СформироватьПисьмо");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКартинкаИнвестПроектыНажатие(Элемент)
	СтандартнаяОбработка = Истина;
	CRM_УправлениеПриложениямиКлиент.ВыполнитьДействиеПриКликеНаПриложение("АКАМ_МодульИнвестиционныхПроектов", СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		ПерейтиПоНавигационнойСсылке("https://akam.ru/products/akam-invest-projects/");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКартинкаCalltouchНажатие(Элемент)
	СтандартнаяОбработка = Истина;
	CRM_УправлениеПриложениямиКлиент.ВыполнитьДействиеПриКликеНаПриложение("ЛИТ_Calltouch", СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		ПерейтиПоНавигационнойСсылке("https://myitlab.ru/portfolio-item/integratsiya-1s-s-calltouch-servisom-skvoznoj-analitiki/");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКартинкаWhatsAppExtendedНажатие(Элемент)
	СтандартнаяОбработка = Истина;
	CRM_УправлениеПриложениямиКлиент.ВыполнитьДействиеПриКликеНаПриложение("ЛИТ_WhatsApp", СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		ПерейтиПоНавигационнойСсылке("https://myitlab.ru/portfolio-item/integratsiya-whatsapp-i-1s-crm/");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКартинкаСистемаВзаимодействияНажатие(Элемент)
	
	Если ЕстьДоступКПодключениюСистемыВзаимодействия() Тогда
		Если СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована() Тогда
			ПерейтиПоНавигационнойСсылке("e1cib/command/Обработка.сфпПодключениеСистемыВзаимодействия.Команда.Отключение");
		Иначе 
			ПерейтиПоНавигационнойСсылке("e1cib/app/Обработка.сфпПодключениеСистемыВзаимодействия");
		КонецЕсли;
	Иначе
		ОткрытьФорму("Обработка.сфпПодключениеСистемыВзаимодействия.Форма"); // Чтобы вышло системное сообщение о недостатке прав
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКартинкаМагазинВКНажатие(Элемент)
	ПроверитьПодключениеОтраслевыхСервисовИОткрыть("ИнтернетМагазинВКонтакте");
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовШапкиФормы

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ЕстьДоступКПодключениюСистемыВзаимодействия()
	Возврат ПравоДоступа("Использование", Метаданные.Обработки.сфпПодключениеСистемыВзаимодействия);
КонецФункции

&НаКлиенте
Процедура ОткрытьТелефонию()
	
	ИмяОткрываемойФормы = "Обработка.сфпАРМ_Телефония.Форма.Форма";
	Синоним = НСтр("ru='Телефония';en='Telephony'");
	
	Если CRM_РабочийСтолКлиент.ФормаОткрытаНаРабочемСтоле(ЭтотОбъект) Тогда
		ИндексФормы = CRM_РабочийСтолКлиент.ПолучитьИндексФормыРабочегоСтола(ЭтотОбъект, ИмяОткрываемойФормы);
		Если ИндексФормы = -1 Тогда
			ОткрытьФорму(ИмяОткрываемойФормы);
		Иначе
			CRM_РабочийСтолКлиент.АктивироватьФормуРабочегоСтола(ЭтотОбъект, ИмяОткрываемойФормы, ИндексФормы);
		КонецЕсли;
	Иначе
		ОткрытьФорму(ИмяОткрываемойФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВключитьНеобходимыеНастройкиНаСервере(ИмяСервиса, ПереинициализироватьРабочийСтол = Ложь, Идентификатор)
	
	ПереинициализироватьРабочийСтол = Ложь;
	
	Если ИмяСервиса = "ПроверитьИТСОтраслевой" Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Константы.CRM_СквознаяАналитика.Получить() Тогда
		Константы.CRM_СквознаяАналитика.Установить(Истина);
	КонецЕсли;
	
	Если НЕ Константы.CRM_ИспользоватьМаркетинговыеМероприятия.Получить() Тогда
		Константы.CRM_ИспользоватьМаркетинговыеМероприятия.Установить(Истина);
	КонецЕсли;
	
	Если НЕ Константы.CRM_ИспользоватьЗаявки.Получить() Тогда
		Константы.CRM_ИспользоватьЗаявки.Установить(Истина);
	КонецЕсли;
	
	// Добавим форму Сквозной аналитики на Рабочий стол
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CRM_НастройкиРабочегоСтола.Наименование КАК Наименование
	               |ИЗ
	               |	РегистрСведений.CRM_НастройкиРабочегоСтола КАК CRM_НастройкиРабочегоСтола
	               |ГДЕ
	               |	CRM_НастройкиРабочегоСтола.Объект = ""Общие настройки""
	               |	И CRM_НастройкиРабочегоСтола.ИмяФормы = ""Обработка.CRM_АРМ_РабочееМестоСквознаяАналитика.Форма.Форма""";
	
	Если Запрос.Выполнить().Пустой() Тогда
		ЗаписьНастройки = РегистрыСведений.CRM_НастройкиРабочегоСтола.СоздатьМенеджерЗаписи();
		ЗаписьНастройки.ИмяФормы = "Обработка.CRM_АРМ_РабочееМестоСквознаяАналитика.Форма.Форма";
		ЗаписьНастройки.Объект = "Общие настройки";
		ЗаписьНастройки.Идентификатор = Строка(Идентификатор);
		ЗаписьНастройки.Наименование = НСтр("ru='Сквозная аналитика';en='End-to-end Analytics'");
		ЗаписьНастройки.Порядок = 90;
		ЗаписьНастройки.Записать(Истина);
		
		ПереинициализироватьРабочийСтол = Истина;
		
	КонецЕсли;
	
КонецПроцедуры // ВключитьНеобходимыеНастройкиНаСервере()

&НаКлиенте
Процедура ПриОтветеНаВопросПодключитьТелефонию(КодВозврата, Параметры) Экспорт
	
	Если КодВозврата = "Подключить" Тогда
		ОткрытьТелефонию();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВыбранныйСервис(ИмяСервиса)
	
	Если ИмяСервиса = "ПроверитьИТСОтраслевой" Тогда
		ПоказатьПредупреждение(, НСтр("ru='Сервисы по подписке доступны!';en='Services available by subscription!'"));
		Возврат;
	КонецЕсли;
	
	Если ИмяСервиса = "CallТрекингНаСайт" Тогда
		
		ТребуетсяНастройкаТелефонии = сфпСофтФонПроСервер.сфпТребуетсяНастройкаТелефонии();
		
		Если ТребуетсяНастройкаТелефонии Тогда
			ТекстВопроса = НСтр("ru='Для использования коллтрекинга требуется подключить Телефонию!"
"Это необходимо для онлайн принятия звонка в 1C:CRM.';en='It is necessary connect Telephony to use call-tracking!"
"It is necessary for online making call in 1C:CRM.'");
			ОбработчикРезультата = Новый ОписаниеОповещения("ПриОтветеНаВопросПодключитьТелефонию", ЭтотОбъект);
			ТекстВопроса = ТекстВопроса + Символы.ПС + Символы.ПС + НСтр("ru='Подключить Телефонию?'");
			СписокКнопок = Новый СписокЗначений();
			СписокКнопок.Добавить("Подключить", НСтр("ru='Подключить'"));
			СписокКнопок.Добавить("Отмена", НСтр("ru='Отмена'"));
			ПоказатьВопрос(ОбработчикРезультата, ТекстВопроса, СписокКнопок);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ИдентификаторФормыСА = Новый УникальныйИдентификатор;
	ВключитьНеобходимыеНастройкиНаСервере(ИмяСервиса, ПереинициализироватьРабочийСтол, ИдентификаторФормыСА);
	
	ИмяФормыСА = "Обработка.CRM_АРМ_РабочееМестоСквознаяАналитика.Форма.Форма";
	
	Если CRM_РабочийСтолКлиент.ФормаОткрытаНаРабочемСтоле(ЭтотОбъект) И ПереинициализироватьРабочийСтол Тогда
		CRM_РабочийСтолКлиент.ПереинициализироватьРабочийСтолКлиент(ИмяФормы);
		// Добавим в список форм форму Сквозной аналитики
		НоваяСтрока = ЭтотОбъект.CRM_НастройкиРабочегоСтола.Добавить();
		НоваяСтрока.Порядок  = 90;
		НоваяСтрока.ПорядокНастроек = 3;
		НоваяСтрока.ИмяФормы = ИмяФормыСА;
		НоваяСтрока.Наименование = НСтр("ru='Сквозная аналитика'");
		НоваяСтрока.Идентификатор =  ИдентификаторФормыСА; 
	КонецЕсли;
	
	Если ИмяСервиса = "СтатистикаСайта" Тогда
		
		Если CRM_РабочийСтолКлиент.ФормаОткрытаНаРабочемСтоле(ЭтотОбъект) Тогда
			CRM_РабочийСтолКлиент.АктивироватьФормуРабочегоСтола(ЭтотОбъект, ИмяФормыСА);
		Иначе
			ОткрытьФорму(ИмяФормыСА);
		КонецЕсли;
		
		ФормаНастройкиСквознойАналитики = ОткрытьФорму("Обработка.CRM_АРМ_РабочееМестоСквознаяАналитика.Форма.ФормаНастройкиСквознойАналитики"
										  ,,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		Если CRM_СистемаСквознойАналитикиВызовСервера.ПроверитьПустоеКоличествоИсточниковАналитики() Тогда
			ОткрытьФорму("Справочник.CRM_ИсточникиРекламныхКампаний.Форма.ФормаПомощникВвода",,ФормаНастройкиСквознойАналитики);
		КонецЕсли;
		
	ИначеЕсли ИмяСервиса = "ВиджетНаСайт" Тогда
		
		Если CRM_РабочийСтолКлиент.ФормаОткрытаНаРабочемСтоле(ЭтотОбъект) Тогда
			CRM_РабочийСтолКлиент.АктивироватьФормуРабочегоСтола(ЭтотОбъект, ИмяФормыСА);
		Иначе
			ОткрытьФорму(ИмяФормыСА);
		КонецЕсли;
		
		ФормаНастройкиСквознойАналитики = ОткрытьФорму("Обработка.CRM_АРМ_РабочееМестоСквознаяАналитика.Форма.ФормаНастройкиСквознойАналитики"
										  ,,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		СписокСценариев = Новый СписокЗначений;
		СписокСценариев.Добавить(ПредопределенноеЗначение("Перечисление.CRM_CallTrakingСценарии.ПочтовоеСообщение"));
		СписокСценариев.Добавить(ПредопределенноеЗначение("Перечисление.CRM_CallTrakingСценарии.WebService"));
		
		КоличествоИсточников = КоличествоИсточниковПолученияЛидов(СписокСценариев);
		Если КоличествоИсточников = 0 Тогда
		
			ФормаИсточниковЛидов = ПолучитьФорму("Справочник.CRM_ИсточникиПолученияЛидов.Форма.ФормаЭлемента",,ФормаНастройкиСквознойАналитики);
			ФормаИсточниковЛидов.Объект.Сценарий = ПредопределенноеЗначение("Перечисление.CRM_CallTrakingСценарии.WebService");
			ФормаИсточниковЛидов.РежимВыбораСценария = "Виджет";
			ФормаИсточниковЛидов.Открыть();
		КонецЕсли;
		
	ИначеЕсли ИмяСервиса = "СервисНаСайт" Тогда
		
		Если CRM_РабочийСтолКлиент.ФормаОткрытаНаРабочемСтоле(ЭтотОбъект) Тогда
			CRM_РабочийСтолКлиент.АктивироватьФормуРабочегоСтола(ЭтотОбъект, ИмяФормыСА);
		Иначе
			ОткрытьФорму(ИмяФормыСА);
		КонецЕсли;
		
		ФормаНастройкиСквознойАналитики = ОткрытьФорму("Обработка.CRM_АРМ_РабочееМестоСквознаяАналитика.Форма.ФормаНастройкиСквознойАналитики"
										  ,,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		СписокСценариев = Новый СписокЗначений;
		СписокСценариев.Добавить(ПредопределенноеЗначение("Перечисление.CRM_CallTrakingСценарии.Comagic"));
		//СписокСценариев.Добавить(ПредопределенноеЗначение("Перечисление.CRM_CallTrakingСценарии.Callibri"));
		СписокСценариев.Добавить(ПредопределенноеЗначение("Перечисление.CRM_CallTrakingСценарии.Roistat"));
	
		КоличествоИсточников = КоличествоИсточниковПолученияЛидов(СписокСценариев);
		
		Если КоличествоИсточников = 0 Тогда
			
			ФормаИсточниковЛидов = ПолучитьФорму("Справочник.CRM_ИсточникиПолученияЛидов.Форма.ФормаЭлемента",,ФормаНастройкиСквознойАналитики);
			ФормаИсточниковЛидов.Объект.Сценарий = ПредопределенноеЗначение("Перечисление.CRM_CallTrakingСценарии.Comagic");
			ФормаИсточниковЛидов.РежимВыбораСценария = "Сервис";
			ФормаИсточниковЛидов.Открыть();
			
		КонецЕсли;
		
	ИначеЕсли ИмяСервиса = "CallТрекингНаСайт" Тогда
	
		Если CRM_РабочийСтолКлиент.ФормаОткрытаНаРабочемСтоле(ЭтотОбъект) Тогда
			CRM_РабочийСтолКлиент.АктивироватьФормуРабочегоСтола(ЭтотОбъект, ИмяФормыСА);
		Иначе
			ОткрытьФорму(ИмяФормыСА);
		КонецЕсли;
		
		ФормаНастройкиСквознойАналитики = ОткрытьФорму("Обработка.CRM_АРМ_РабочееМестоСквознаяАналитика.Форма.ФормаНастройкиСквознойАналитики"
										  ,,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		СписокСценариев = Новый СписокЗначений;
		СписокСценариев.Добавить(ПредопределенноеЗначение("Перечисление.CRM_CallTrakingСценарии.Comagic"));
		СписокСценариев.Добавить(ПредопределенноеЗначение("Перечисление.CRM_CallTrakingСценарии.UIS"));
		//СписокСценариев.Добавить(ПредопределенноеЗначение("Перечисление.CRM_CallTrakingСценарии.Callibri"));
		СписокСценариев.Добавить(ПредопределенноеЗначение("Перечисление.CRM_CallTrakingСценарии.Roistat"));
	
		КоличествоИсточников = КоличествоИсточниковПолученияЛидов(СписокСценариев);
		
		Если КоличествоИсточников = 0 Тогда
			
			ФормаИсточниковЛидов = ПолучитьФорму("Справочник.CRM_ИсточникиПолученияЛидов.Форма.ФормаЭлемента",,ФормаНастройкиСквознойАналитики);
			ФормаИсточниковЛидов.Объект.Сценарий = ПредопределенноеЗначение("Перечисление.CRM_CallTrakingСценарии.Comagic");
			ФормаИсточниковЛидов.РежимВыбораСценария = "Коллтрекинг";
			ФормаИсточниковЛидов.Объект.ИспользоватьГенераторЗвонка = Истина;
			ФормаИсточниковЛидов.Открыть();
			
		КонецЕсли;
		
	ИначеЕсли ИмяСервиса = "МоделиМашинногоОбучения" Тогда
		CRM_МоделиМашинногоОбученияКлиент.ОткрытьНастройкиМоделей();
	ИначеЕсли СтрНайти(ИмяСервиса, "ИнтернетМагазин") > 0 Тогда
		СоздатьИнтеграциюСМагазином(СтрЗаменить(ИмяСервиса, "ИнтернетМагазин", ""));
	ИначеЕсли СтрНайти(ИмяСервиса, "Мессенджер") > 0 Тогда
		СоздатьКаналДиалогов(СтрЗаменить(ИмяСервиса, "Мессенджер", ""));
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - проверка наличия элементов в справочнике "Источники получения заявок"
//
// Параметры:
//  СписокИсключений - список значений, содержит значения для отбора в запросе
// 
// Возвращаемое значение:
//  Булево - Результат выполнения функции. Истина, если элементов нет.
//
Функция КоличествоИсточниковПолученияЛидов(СписокИсключений = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(CRM_ИсточникиПолученияЛидов.Ссылка) КАК КоличествоЭлементов
	|ИЗ
	|	Справочник.CRM_ИсточникиПолученияЛидов КАК CRM_ИсточникиПолученияЛидов
	|ГДЕ
	|	%СписокИсключений% НЕ CRM_ИсточникиПолученияЛидов.ПометкаУдаления";
	
	ОтборПоСпискуИсключений = "CRM_ИсточникиПолученияЛидов.Сценарий В (&СписокИсключений) И";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%СписокИсключений%", ?(СписокИсключений <> Неопределено, ОтборПоСпискуИсключений, ""));
	Запрос.УстановитьПараметр("СписокИсключений", СписокИсключений); 
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	РезультатЗапроса.Следующий();
	
	Возврат РезультатЗапроса.КоличествоЭлементов;
	
КонецФункции // КоличествоИсточниковПолученияЛидов()

&НаСервереБезКонтекста
Функция ПроверитьПодключениеИнтернетПоддержкиНаСервере()
	
	Возврат ИнтернетПоддержкаПользователей.ЗаполненыДанныеАутентификацииПользователяИнтернетПоддержки();
	
КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьПодключениеКОтраслевымСервисамНаСервере(ОписаниеОшибки)
	
	Возврат CRM_ЛицензированиеЭкспортныеМетоды.ПолучитьЗащищеннуюОбработку().ПодключениеКОтраслевымСервисамДоступно(ОписаниеОшибки);
	
КонецФункции

&НаКлиенте
Процедура ПриОтветеНаВопросОткрытьМониторПортала(КодВозврата, Параметры) Экспорт
	
	Если КодВозврата = "ОткрытьМонитор" Тогда
		Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.МониторПортала1СИТС") Тогда
			МодульМониторПортала1СИТСКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("МониторПортала1СИТСКлиент");
			МодульМониторПортала1СИТСКлиент.ИнтернетПоддержкаИСервисы_МониторПортала1СИТС(
				ЭтотОбъект,
				Неопределено);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключениеИнтернетПоддержкиЗавершение(Результат, ИмяСервиса) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ОписаниеОшибки = "";
	СервисыДоступны = ПроверитьПодключениеКОтраслевымСервисамНаСервере(ОписаниеОшибки);
	
	Если НЕ СервисыДоступны Тогда
		//ТекстВопроса = НСтр("ru='Внимание! Подписка 1С:ИТС Отраслевой или доступ к Порталу 1С:ИТС отсутствует!
		ТекстВопроса = НСтр("ru='Внимание! Подписка 1С:ИТС Отраслевой отсутствует!"
"Выбранный сервис не доступен для использования.'");
		Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			ТекстВопроса = ТекстВопроса + Символы.ПС + НСтр("ru='(Описание ошибки см. в Журнале регистрации).'");
		КонецЕсли;
		ТекстВопроса = ТекстВопроса + Символы.ПС + Символы.ПС + 
			НСтр("ru='Описание подключения 1С:ИТС Отраслевой см. в Мониторе Портала 1С:ИТС.'");
			
		ОбработчикРезультата = Новый ОписаниеОповещения("ПриОтветеНаВопросОткрытьМониторПортала", ЭтотОбъект);
		СписокКнопок = Новый СписокЗначений();
		СписокКнопок.Добавить("ОткрытьМонитор", НСтр("ru='Открыть Монитор'"));
		СписокКнопок.Добавить("Отмена", НСтр("ru='Отмена'"));
		
		ПоказатьВопрос(ОбработчикРезультата, ТекстВопроса, СписокКнопок);
		
	Иначе
		ОткрытьВыбранныйСервис(ИмяСервиса);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОтветеНаВопросПодключитьИнтернетПоддержку(КодВозврата, ИмяСервиса) Экспорт
	
	Если КодВозврата <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ОбработчикРезультата = Новый ОписаниеОповещения("ПодключениеИнтернетПоддержкиЗавершение", ЭтотОбъект, ИмяСервиса);
	ИнтернетПоддержкаПользователейКлиент.ПодключитьИнтернетПоддержкуПользователей(ОбработчикРезультата);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключениеОтраслевыхСервисовИОткрыть(ИмяСервиса)
	
	ПоддержкаАктивна = ПроверитьПодключениеИнтернетПоддержкиНаСервере();
	
	Если НЕ ПоддержкаАктивна Тогда
		
		ТекстСообщения = НСтр("ru='Для работы необходимо подключить Интернет-поддержку и иметь активную подписку 1С:ИТС Отраслевой.'");
		Если Не ИнтернетПоддержкаПользователейКлиент.ДоступноПодключениеИнтернетПоддержки() Тогда
			ПоказатьПредупреждение(, ТекстСообщения + Символы.ПС + НСтр("ru='Обратитесь к администратору.'"));
			Возврат;
		КонецЕсли;
		
		ОбработчикРезультата = Новый ОписаниеОповещения("ПриОтветеНаВопросПодключитьИнтернетПоддержку", ЭтотОбъект, ИмяСервиса);
		ТекстВопроса = ТекстСообщения + Символы.ПС  + Символы.ПС + НСтр("ru='Подключить Интернет-поддержку?'");
		ПоказатьВопрос(ОбработчикРезультата, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе 
		ПодключениеИнтернетПоддержкиЗавершение(Истина, ИмяСервиса);

	КонецЕсли;
	
КонецПроцедуры // ПроверитьПодключениеОтраслевыхСервисовИОткрыть()

&НаСервереБезКонтекста
// Функция - проверка наличия подключенных аккантов диалогов определенного типа
//
// Параметры:
//  ТипМессенджера - строка - название мессенджера
// 
// Возвращаемое значение:
//  Булево - Результат проверки. Истина, если есть элементы.
//
Функция ЕстьПодключенныеУчетныеЗаписиМессенджеров(ТипМессенджера)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CRM_УчетныеЗаписиМессенджеров.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CRM_УчетныеЗаписиМессенджеров КАК CRM_УчетныеЗаписиМессенджеров
	               |ГДЕ
	               |	CRM_УчетныеЗаписиМессенджеров.Включена
	               |	И НЕ CRM_УчетныеЗаписиМессенджеров.ПометкаУдаления
	               |	И CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = &ТипМессенджера";
	
	Запрос.УстановитьПараметр("ТипМессенджера", ТипМессенджера);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		Возврат РезультатЗапроса.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // ЕстьПодключенныеУчетныеЗаписиМессенджеров()

&НаКлиенте
Процедура СоздатьКаналДиалогов(ТипМессенджера)

	УстановитьКонстанту("CRM_ИспользоватьИнтеграциюСМессенджерами");
	
	Канал = ЕстьПодключенныеУчетныеЗаписиМессенджеров(ТипМессенджера);
	Если Канал <> Неопределено Тогда
		ПараметрыФормы = Новый Структура("ТекущаяСтрока", Канал);
		ОткрытьФорму("Справочник.CRM_УчетныеЗаписиМессенджеров.ФормаСписка", ПараметрыФормы, ЭтотОбъект);
		
	Иначе
		ПараметрыФормы = Новый Структура("ТипМессенджера", ТипМессенджера);
		ОткрытьФорму("Справочник.CRM_УчетныеЗаписиМессенджеров.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - проверка наличия подключенных аккантов диалогов определенного типа
//
// Параметры:
//  ТипМессенджера - строка - название мессенджера
// 
// Возвращаемое значение:
//  Булево - Результат проверки. Истина, если есть элементы.
//
Функция ЕстьПодключенныеИнтернетМагазины(ТипМагазина)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CRM_ИнтеграцииСИнтернетМагазинами.Ссылка КАК Ссылка
	               |ИЗ
	               |	ПланОбмена.CRM_ИнтеграцииСИнтернетМагазинами КАК CRM_ИнтеграцииСИнтернетМагазинами
	               |ГДЕ
	               |	CRM_ИнтеграцииСИнтернетМагазинами.ТипИнтернетМагазина = &ТипИнтернетМагазина
	               |	И НЕ CRM_ИнтеграцииСИнтернетМагазинами.ПометкаУдаления
	               |	И CRM_ИнтеграцииСИнтернетМагазинами.Включена";
	
	Запрос.УстановитьПараметр("ТипИнтернетМагазина", ТипМагазина);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		Возврат РезультатЗапроса.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // ЕстьПодключенныеУчетныеЗаписиМессенджеров()

&НаКлиенте
Процедура СоздатьИнтеграциюСМагазином(ТипМагазина)

	УстановитьКонстанту("CRM_ИспользоватьИнтеграцииСИнтернетМагазинами");
	
	Магазин = ЕстьПодключенныеИнтернетМагазины(ТипМагазина);
	Если Магазин <> Неопределено Тогда
		ПараметрыФормы = Новый Структура("ТекущаяСтрока", Магазин);
		ОткрытьФорму("ПланОбмена.CRM_ИнтеграцииСИнтернетМагазинами.ФормаСписка", ПараметрыФормы, ЭтотОбъект);
		
	Иначе
		ПараметрыФормы = Новый Структура("ТипИнтернетМагазина", ТипМагазина);
		ОткрытьФорму("ПланОбмена.CRM_ИнтеграцииСИнтернетМагазинами.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьКонстанту(ИмяКонстанты)
	Если НЕ Константы[ИмяКонстанты].Получить() Тогда
		Константы[ИмяКонстанты].Установить(Истина);
	КонецЕсли;
КонецПроцедуры

// +Рабочий стол
#Область Подключаемый_РабочийСтол

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	CRM_СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеHTMLНапоминанийПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	CRM_РабочийСтолКлиент.ПолеHTMLНапоминанийПриНажатии(ЭтаФорма, Элемент, ДанныеСобытия, СтандартнаяОбработка);
КонецПроцедуры // Подключаемый_ПолеHTMLНапоминанийПриНажатии()

&НаКлиенте
Процедура Подключаемый_ПолеHTMLЗаметокПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	CRM_РабочийСтолКлиент.ПолеHTMLЗаметокПриНажатии(ЭтаФорма, Элемент, ДанныеСобытия, СтандартнаяОбработка);
КонецПроцедуры // Подключаемый_ПолеHTMLЗаметокПриНажатии()

#КонецОбласти
// -Рабочий стол

#КонецОбласти // СлужебныеПроцедурыИФункции
